# DivideVolumesProfilesForWidthSome Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..DivideVolumesProfilesForWidthSome Property
BuiltInFailures..::..DPartFailures Class See Also
---
Division family cannot be used for some widths of hosts
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DivideVolumesProfilesForWidthSome { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DivideVolumesProfilesForWidthSome As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DivideVolumesProfilesForWidthSome {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace